In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [4]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [13]:
pd.read_sql(
    '''
    select * from(
    SELECT * FROM boston
    
    )
    ''',
    con,
).shape

(506, 14)

In [6]:
tasks = set()

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [7]:
tasks.add(1)
pd.read_sql(
    '''
    SELECT 'CRIM' as column_name, COUNT(CRIM) as null_count FROM boston
    WHERE CRIM is Null
    UNION
    SELECT 'ZN', COUNT(ZN) FROM boston
    WHERE ZN is Null
    UNION
    SELECT 'INDUS', COUNT(INDUS) FROM boston
    WHERE INDUS is Null
    UNION
    SELECT 'CHAS', COUNT(CHAS) FROM boston
    WHERE CHAS is Null
    UNION
    SELECT 'NOX', COUNT(NOX) FROM boston
    WHERE NOX is Null
    ''',
    con,
)

  column_name  null_count
0        CHAS           0
1        CRIM           0
2       INDUS           0
3         NOX           0
4          ZN           0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [8]:
tasks.add(2)
pd.read_sql(
    '''
    SELECT 'CRIM' as column_name, COUNT(DISTINCT CRIM) as unique_count FROM boston
    UNION
    SELECT 'ZN', COUNT(DISTINCT ZN) FROM boston
    UNION
    SELECT 'INDUS', COUNT(DISTINCT INDUS) FROM boston
    UNION
    SELECT 'CHAS', COUNT(DISTINCT CHAS) FROM boston
    UNION
    SELECT 'NOX', COUNT(DISTINCT NOX) FROM boston
    ''',
    con,
)

  column_name  unique_count
0        CHAS             2
1        CRIM           504
2       INDUS            76
3         NOX            81
4          ZN            26

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [9]:
tasks.add(3)
pd.read_sql(
    '''
    SELECT * FROM (
        SELECT 'CRIM' AS column_name, 
        MIN(CRIM) AS min,    
        (SELECT AVG(med) AS median FROM (
            SELECT MAX(CRIM) AS med FROM (
                SELECT * FROM boston 
                ORDER BY CRIM 
                LIMIT (SELECT ROUND(COUNT(CRIM)/2.0) FROM boston)
            )
            UNION
            SELECT MIN(CRIM) AS med FROM (
                SELECT * FROM boston 
                ORDER BY CRIM DESC
                LIMIT (SELECT ROUND(COUNT(CRIM)/2.0) FROM boston)
            )
        )) AS median FROM boston

        UNION 

        SELECT 'ZN' AS column_name, 
        MIN(ZN) AS min,    
        (SELECT AVG(med) AS median FROM (
            SELECT MAX(ZN) AS med FROM (
                SELECT * FROM boston 
                ORDER BY ZN 
                LIMIT (SELECT ROUND(COUNT(ZN)/2.0) FROM boston)
            )
            UNION
            SELECT MIN(ZN) AS med FROM (
                SELECT * FROM boston 
                ORDER BY ZN DESC
                LIMIT (SELECT ROUND(COUNT(ZN)/2.0) FROM boston)
            )
        )) AS median FROM boston

        UNION

        SELECT 'INDUS' AS column_name, 
        MIN(INDUS) AS min,    
        (SELECT AVG(med) AS median FROM (
            SELECT MAX(INDUS) AS med FROM (
                SELECT * FROM boston 
                ORDER BY INDUS 
                LIMIT (SELECT ROUND(COUNT(INDUS)/2.0) FROM boston)
            )
            UNION
            SELECT MIN(INDUS) AS med FROM (
                SELECT * FROM boston 
                ORDER BY INDUS DESC
                LIMIT (SELECT ROUND(COUNT(INDUS)/2.0) FROM boston)
            )
        )) AS median FROM boston

        UNION 

        SELECT 'CHAS' AS column_name, 
        MIN(CHAS) AS min,    
        (SELECT AVG(med) AS median FROM (
            SELECT MAX(CHAS) AS med FROM (
                SELECT * FROM boston 
                ORDER BY CHAS 
                LIMIT (SELECT ROUND(COUNT(CHAS)/2.0) FROM boston)
            )
            UNION
            SELECT MIN(CHAS) AS med FROM (
                SELECT * FROM boston 
                ORDER BY CHAS DESC
                LIMIT (SELECT ROUND(COUNT(CHAS)/2.0) FROM boston)
            )
        )) AS median FROM boston

        UNION

        SELECT 'NOX' AS column_name, 
        MIN(NOX) AS min,    
        (SELECT AVG(med) AS median FROM (
            SELECT MAX(NOX) AS med FROM (
                SELECT * FROM boston 
                ORDER BY NOX 
                LIMIT (SELECT ROUND(COUNT(NOX)/2.0) FROM boston)
            )
            UNION
            SELECT MIN(NOX) AS med FROM (
                SELECT * FROM boston 
                ORDER BY NOX DESC
                LIMIT (SELECT ROUND(COUNT(NOX)/2.0) FROM boston)
            )
        )) AS median FROM boston
    ) 
    WHERE min = median
    
    ''',
    con,
)

  column_name  min  median
0        CHAS  0.0     0.0
1          ZN  0.0     0.0

*–ë–æ–ª—å—à–∞—è —á–∞—Å—Ç—å –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CHAS –∏ ZN –∑–∞–ø–æ–ª–Ω–µ–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω—ã–º–∏ –∑–Ω–∞—á–µ–Ω–∏—è–º–∏. –¢.–µ. –±–æ–ª—å—à–∞—è —á–∞—Å—Ç—å —Ä–∞–π–æ–Ω–æ–≤ –Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, –∏ –±–æ–ª—å—à–∞—è —á–∞—Å—Ç—å —Ä–∞–π–æ–Ω–æ–≤ –∏–º–µ–µ—Ç –¥–æ–ª—é –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–Ω—ã—Ö –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤ —Ñ—É—Ç–æ–≤ —Ä–∞–≤–Ω—É—é 0*

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [10]:
tasks.add(4)
pd.read_sql(
    '''
    WITH EXPENCIVE AS (
        SELECT AVG(RM) FROM BOSTON where MEDV = (select MAX(MEDV) from boston)
    )
    
    
    SELECT houses_count,  avg_rm, max_price_avg_rm, max_price_avg_rm - avg_rm AS diff FROM 
    (
        SELECT '25' as houses_count, AVG(RM) as avg_rm, (SELECT * FROM EXPENCIVE) as max_price_avg_rm    
        FROM (
            SELECT RM, MEDV FROM boston
            ORDER BY MEDV
            LIMIT 25
        ) 

        UNION ALL

        SELECT '50', AVG(RM), (SELECT * FROM EXPENCIVE) FROM (
            SELECT RM, MEDV FROM boston
            ORDER BY MEDV
            LIMIT 50
        ) 

        UNION ALL

        SELECT '100', AVG(RM), (SELECT * FROM EXPENCIVE) FROM (
            SELECT RM, MEDV FROM boston
            ORDER BY MEDV
            LIMIT 100
        ) 

        UNION ALL

        SELECT '200', AVG(RM), (SELECT * FROM EXPENCIVE) FROM (
            SELECT RM, MEDV FROM boston
            ORDER BY MEDV
            LIMIT 200
        ) 

        UNION ALL

        SELECT '300', AVG(RM), (SELECT * FROM EXPENCIVE) FROM (
            SELECT RM, MEDV FROM boston
            ORDER BY MEDV
            LIMIT 300
        )         
    
    )    

    ''',
    con,
)

  houses_count    avg_rm  max_price_avg_rm      diff
0           25  5.747840             7.484  1.736160
1           50  5.753240             7.484  1.730760
2          100  5.887120             7.484  1.596880
3          200  5.911705             7.484  1.572295
4          300  5.972227             7.484  1.511773

*–¢–∫ —Å –¥–æ–±–∞–≤–ª–µ–Ω–∏–µ–º –∑–∞–ø–∏—Å–µ–π (–æ—Ç 25 –¥–æ 300) —Å –±–æ–ª–µ–µ –¥–æ—Ä–æ–≥–æ–π –Ω–µ–¥–≤–∏–∂–∏–º–æ—Å—Ç—å—é, —Ä–∞—Å—Ç–µ—Ç –∏ —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –∫–æ–º–Ω–∞—Ç –≤ –¥–æ–º–∞—Ö –∏ —Ä–∞–∑–Ω–∏—Ü–∞ —Å–æ —Å—Ä–µ–¥–Ω–∏–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π –Ω–µ–¥–≤–∏–∂–∏–º–æ—Å—Ç–∏ —Å–Ω–∏–∂–∞–µ—Ç—Å—è, –º–æ–∂–Ω–æ –ø—Ä–µ–¥–ø–æ–ª–æ–∂–∏—Ç—å, —á—Ç–æ —Å–≤—è–∑—å –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–∏–º –∫–æ–ª–∏—á–µ—Å—Ç–æ–≤–º –∫–æ–º–Ω–∞—Ç –∏ —Ü–µ–Ω–æ–π –µ—Å—Ç—å*

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [15]:
tasks.add(5)
pd.read_sql(
    '''    
    SELECT * FROM(
        SELECT LSTAT, MEDV, rank() OVER(ORDER BY LSTAT) as rank FROM boston
    )    
    WHERE MEDV = (select MAX(MEDV) from boston)
   
    ''',
    con,
)

    LSTAT  MEDV  rank
0    1.73  50.0     1
1    1.92  50.0     2
2    2.88  50.0     6
3    2.96  50.0     8
4    2.97  50.0     9
5    3.16  50.0    15
6    3.26  50.0    17
7    3.32  50.0    18
8    3.70  50.0    26
9    3.73  50.0    27
10   4.45  50.0    41
11   4.63  50.0    50
12   5.12  50.0    67
13   7.44  50.0   141
14   8.88  50.0   181
15   9.53  50.0   203

*–û—Å–Ω–æ–≤–Ω–∞—è —á–∞—Å—Ç—å –¥–æ—Ä–æ–≥–æ–π –Ω–µ–¥–≤–∏–∂–∏–º–æ—Å—Ç–∏ –∏–º–µ—é—Ç –Ω–∏–∑–∫–∏–π –ø—Ä–æ—Ü–µ–Ω—Ç LSTAT - —á—É—Ç—å –±–æ–ª—å—à–µ 5% (–ø–æ—Å–ª–µ–¥–Ω–∏–µ 3 –∑–∞–ø–∏—Å–∏ –º–æ–∂–Ω–æ —Å–∫–æ—Ä–µ–µ –æ—Ç–Ω–µ—Å—Ç–∏ –∫ –≤—ã–±—Ä–æ—Å–∞–º)*

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [20]:
tasks.add(6)
pd.read_sql(
    '''
    SELECT CASE WHEN CHAS = 0 THEN '–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç' ELSE '–≥—Ä–∞–Ω–∏—á–∏—Ç' END AS CHAS, AVG(MEDV) FROM boston
    GROUP BY CHAS
    ''',
    con,
)

          CHAS  AVG(MEDV)
0  –Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç  22.093843
1     –≥—Ä–∞–Ω–∏—á–∏—Ç  28.440000

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [44]:
tasks.add(7)
pd.read_sql(
    '''
    WITH MEANS AS (
        SELECT * FROM(
            SELECT CHAS, 
            AVG(CRIM) OVER (PARTITION BY CHAS) as mean_crim, 
            AVG(ZN) OVER (PARTITION BY CHAS)  as mean_zn,
            AVG(INDUS) OVER (PARTITION BY CHAS) as mean_indus, 
            AVG(NOX) OVER (PARTITION BY CHAS) as mean_nox FROM boston
        )
        GROUP BY CHAS        
    )
    
    SELECT * FROM(
        SELECT DISTINCT 'CRIM' as column, 
        (SELECT mean_crim FROM MEANS WHERE CHAS = 0) as chas_n, 
        (SELECT mean_crim FROM MEANS WHERE CHAS = 1) as chas_y 
        FROM MEANS

        UNION ALL

        SELECT DISTINCT 'ZN' as column, 
        (SELECT mean_zn FROM MEANS WHERE CHAS = 0) as chas_n, 
        (SELECT mean_zn FROM MEANS WHERE CHAS = 1) as chas_y 
        FROM MEANS

        UNION ALL

        SELECT DISTINCT 'INDUS' as column, 
        (SELECT mean_indus FROM MEANS WHERE CHAS = 0) as chas_n, 
        (SELECT mean_indus FROM MEANS WHERE CHAS = 1) as chas_y 
        FROM MEANS

        UNION ALL

        SELECT DISTINCT 'NOX' as column, 
        (SELECT mean_nox FROM MEANS WHERE CHAS = 0) as chas_n, 
        (SELECT mean_nox FROM MEANS WHERE CHAS = 1) as chas_y 
        FROM MEANS
    )        
    
    WHERE chas_y > chas_n    
    
    ''',
    con,
)

  column     chas_n     chas_y
0  INDUS  11.019193  12.719143
1    NOX   0.551817   0.593426

*–í —Ä–∞–π–æ–Ω–∞—Ö –ø—Ä–∏–ª–µ–≥–∞—é—â–∏—Ö –∫ —Ä–µ–∫–µ –±–æ–ª—å—à–µ –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω—ã—Ö —É—á–∞—Å—Ç–∫–æ–≤, —Ç–∫ —Å—Ä–µ–¥–Ω–∏–µ –∑–Ω–∞—á–µ–Ω–∏—è –ø–æ –¥–æ–ª–µ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –∏ –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –∞–∑–æ—Ç–∞ –≤ –≤–æ–∑–¥—É—Ö–µ –≤—ã—à–µ*

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [60]:
tasks.add(8)
pd.read_sql(
    '''
    WITH PERCENTILE AS (
        SELECT INDUS, NOX, NTILE(10) OVER(ORDER BY INDUS, NOX) AS percentile_n FROM boston
    )
    
    SELECT '10' AS percentile, AVG(INDUS) as avg_indus, AVG(NOX) as avg_nox 
    FROM PERCENTILE 
    WHERE percentile_n = 1
    UNION ALL
    SELECT '20' AS percentile, AVG(INDUS) as avg_indus, AVG(NOX) as avg_nox 
    FROM PERCENTILE 
    WHERE percentile_n = 2
    UNION ALL
    SELECT '30' AS percentile, AVG(INDUS) as avg_indus, AVG(NOX) as avg_nox 
    FROM PERCENTILE 
    WHERE percentile_n = 3
    UNION ALL
    SELECT '40' AS percentile, AVG(INDUS) as avg_indus, AVG(NOX) as avg_nox 
    FROM PERCENTILE 
    WHERE percentile_n = 4
    UNION ALL
    SELECT '50' AS percentile, AVG(INDUS) as avg_indus, AVG(NOX) as avg_nox 
    FROM PERCENTILE 
    WHERE percentile_n = 5
    UNION ALL
    SELECT '60' AS percentile, AVG(INDUS) as avg_indus, AVG(NOX) as avg_nox 
    FROM PERCENTILE 
    WHERE percentile_n = 6
    UNION ALL
    SELECT '70' AS percentile, AVG(INDUS) as avg_indus, AVG(NOX) as avg_nox 
    FROM PERCENTILE 
    WHERE percentile_n = 7
    UNION ALL
    SELECT '80' AS percentile, AVG(INDUS) as avg_indus, AVG(NOX) as avg_nox 
    FROM PERCENTILE 
    WHERE percentile_n = 8
    UNION ALL
    SELECT '90' AS percentile, AVG(INDUS) as avg_indus, AVG(NOX) as avg_nox 
    FROM PERCENTILE 
    WHERE percentile_n = 9
    UNION ALL
    SELECT '100' AS percentile, AVG(INDUS) as avg_indus, AVG(NOX) as avg_nox 
    FROM PERCENTILE 
    WHERE percentile_n = 10
    
    ''',
    con,
)

  percentile  avg_indus   avg_nox
0         10   2.016078  0.438378
1         20   3.645294  0.494129
2         30   5.246275  0.448235
3         40   6.471765  0.470839
4         50   8.256078  0.531510
5         60  10.749216  0.515176
6         70  17.245800  0.564920
7         80  18.100000  0.684880
8         90  18.307200  0.714620
9        100  21.938800  0.692860

*–í —Ü–µ–ª–æ–º —Å —Ä–æ—Å—Ç–æ–º —Å—Ä–µ–¥–Ω–µ–≥–æ –∑–Ω–∞–µ—á–Ω–∏—è –∏–Ω–¥–µ–∫—Å–∞ INDUS —Ä–∞—Å—Ç–µ—Ç –∏ —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –∏–Ω–¥–µ–∫—Å–∞ NOX, –Ω–æ –≤ –Ω–µ–∫–æ—Ç–æ—Ä—ã—Ö –≥—Ä—É–ø–ø–∞—Ö –ø—Ä–∏ —ç—Ç–æ–º –º–æ–∂–Ω–æ –≤–∏–¥–µ—Ç—å —É–º–µ–Ω—å—à–µ–Ω–∏–µ —Å—Ä–µ–¥–Ω–µ–≥–æ –∑–Ω–∞—á–µ–Ω–∏—è NOX*

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [62]:
if len(tasks) == 8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ